# FinalTask_GB_MainQuarter

## <u>Задача</u>: 

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

***

## <u>Описание алгоритма решения</u>:

- Просим пользователя ввести элементы массива и считываем его.
```
Console.WriteLine("Введите элементы массива через пробел:"); 
string input = Console.ReadLine(); //
string[] inputArray = input.Split(new[] { ' ' },StringSplitOptions.RemoveEmptyEntries);
```
Split - разделение (в качестве разделителя используется пробел).
StringSplitOptions.RemoveEmptyEntries - удаление пустот.
Если, например, пробел случайно был нажат более одного раза, или пробел был нажат после введения последнего элемента.

- Считаем количество элементов, длина которых менее либо равна трем символам.
```
int count = 0; // Переменная для подсчета кол-ва выполненных условий (количество строк, длина которых меньше, либо равна 3 символам)
for (int i = 0; i < inputArray.Length; i++)
{
    if (inputArray[i].Length <= 3) // проверяем длину каждой строки (элемента) в массиве, который мы ввели.
    {
        count++; 
    }
}
```
```
string[] resultArray = new string[count];
``` 
(в зависимости от count в новом массиве будет count строк (элементов). Например, ввели 5 строк, из них 2  - подходят под условия, значит, у создается новый массив с двумя элементами.)


- Запролняем новый массив элементами с символами, прошедших проверку.
```
int index = 0; // (счетчик, индекс) нового массива. 
for (int i = 0; i < inputArray.Length; i++)
{
    if (inputArray[i].Length <= 3)
    {
        resultArray[index] = inputArray[i];
        index++;
    }
}
```

- Делаем красивый вывод как в примере. Для этого объявляем переменные inputOutput и resultOutput.

```
string inputOutput = string.Join("\", \"", inputArray);
string resultOutput = string.Join("\", \"", resultArray);
```


- Красивый вывод как в примере.

```
Console.WriteLine($"[\"{inputOutput}\"] -> [\"{resultOutput}\"]")
```